Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_crypto_ctrl.h
/**************************************************************************//**
 * @file     rtl8710c_crypto_ctrl.h
 * @brief    This file defines adapter,rom stubs structure and other related common MACRO_VARs for CRYPTO.
 * @version  v1.00
 * @date     2022/04/11
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

/**
 * @addtogroup hs_hal_crypto CRYPTO
 * @ingroup 8710c_hal
 * @{
 */

#ifndef RTL8710C_CRYPTO_CTRL_H
#define RTL8710C_CRYPTO_CTRL_H

#ifdef __cplusplus
extern "C" {
#endif

#include "rtl8735b_crypto.h"

#define CRC_ROM_CTRL_RDY            (0)

/* Macros for hp crypto module general configuration */
#define CRYPTO_MAX_DIGEST_LENGTH    32  // SHA256 Digest length : 32
#define CRYPTO_MAX_KEY_LENGTH       32  // MAX  is  AES-256 : 32 byte,  3DES : 24 byte
#define CRYPTO_AUTH_PADDING         64  // HMAC key maximum size is 64 bytes
#define CRYPTO_PADSIZE              64
#define CRYPTO_PADSIZE_SHA512       128


// Mode Select
#define CRYPTO_MS_TYPE_CIPHER       (0)
#define CRYPTO_MS_TYPE_AUTH         (1)
#define CRYPTO_MS_TYPE_MIX          (2)

//HASH Type
/* Macros for hp crypto module hash type configuration */

// HASH General
/* Macros for hp crypto module hash type general configuration */
#define AUTH_TYPE_NO_AUTH           ((u32)-1)

#define AUTH_TYPE_MASK_FUNC         0x3 // bit 0, bit 1
#define AUTH_TYPE_MD5               0x2
#define AUTH_TYPE_SHA1              0x0
#define AUTH_TYPE_SHA2              0x1

#define AUTH_TYPE_MASK_HMAC         0x4 // bit 2
#define AUTH_TYPE_HMAC_MD5          (AUTH_TYPE_MD5 | AUTH_TYPE_MASK_HMAC)
#define AUTH_TYPE_HMAC_SHA1         (AUTH_TYPE_SHA1 | AUTH_TYPE_MASK_HMAC)
#define AUTH_TYPE_HMAC_SHA2         (AUTH_TYPE_SHA2 | AUTH_TYPE_MASK_HMAC)

#define AUTH_TYPE_MASK_FUNC_ALL     (AUTH_TYPE_MASK_FUNC| AUTH_TYPE_MASK_HMAC)

#define CRYPTO_MD5_DIGEST_LENGTH    16
#define CRYPTO_SHA1_DIGEST_LENGTH   20
#define CRYPTO_SHA2_DIGEST_LENGTH   32

// SHA2
/* Macros for hp crypto module general hash type sha2 configuration */
#define AUTH_TYPE_MASK_SHA2         0x70 // bit 3,4
#define AUTH_TYPE_SHA2_224          0x10
#define AUTH_TYPE_SHA2_256          0x20
#define AUTH_TYPE_SHA2_384          0x30
#define AUTH_TYPE_SHA2_512          0x40


#define AUTH_TYPE_SHA2_224_ALL      (AUTH_TYPE_SHA2_224|AUTH_TYPE_SHA2)
#define AUTH_TYPE_SHA2_256_ALL      (AUTH_TYPE_SHA2_256|AUTH_TYPE_SHA2)
#define AUTH_TYPE_SHA2_384_ALL      (AUTH_TYPE_SHA2_384|AUTH_TYPE_SHA2)
#define AUTH_TYPE_SHA2_512_ALL      (AUTH_TYPE_SHA2_512|AUTH_TYPE_SHA2)


#define AUTH_TYPE_HMAC_SHA2_224_ALL (AUTH_TYPE_SHA2_224|AUTH_TYPE_HMAC_SHA2)
#define AUTH_TYPE_HMAC_SHA2_256_ALL (AUTH_TYPE_SHA2_256|AUTH_TYPE_HMAC_SHA2)
#define AUTH_TYPE_HMAC_SHA2_384_ALL (AUTH_TYPE_SHA2_384|AUTH_TYPE_HMAC_SHA2)
#define AUTH_TYPE_HMAC_SHA2_512_ALL (AUTH_TYPE_SHA2_512|AUTH_TYPE_HMAC_SHA2)


#define SHA2_NONE                   0
#define SHA2_224                    (224/8)
#define SHA2_256                    (256/8)
#define SHA2_384                    (384/8)
#define SHA2_512                    (512/8)

// Cipher Type
/* Macros for hp crypto module cipher type configuration */
#define CIPHER_TYPE_NO_CIPHER       ((u32)-1)

#define CIPHER_TYPE_MODE_ENCRYPT    0x80

#define CIPHER_TYPE_MASK_ALL        0x3F
#define CIPHER_TYPE_MASK_FUNC       0x30    // 0x00 : DES, 0x10: 3DES, 0x20: AES
#define CIPHER_TYPE_FUNC_DES        0x00
#define CIPHER_TYPE_FUNC_3DES       0x10
#define CIPHER_TYPE_FUNC_AES        0x20
#define CIPHER_TYPE_FUNC_CHACHA     0x30    //Including(chaha_poly1305,chacha20,poly1305)

#define CIPHER_TYPE_FUNC_CHACHA_POLY1305    0x30
#define CIPHER_TYPE_FUNC_CHACHA20           0x31

#define CIPHER_TYPE_MASK_BLOCK      0xF   // 0x0:ECB, 0x1:CBC, 0x2:CFB , 0x3:OFB , 0x4:CTR, 0x5:GCTR, 0x6:GMAC, 0x7:GHASH, 0x8:GCM
#define CIPHER_TYPE_BLOCK_ECB       0x0
#define CIPHER_TYPE_BLOCK_CBC       0x1
#define CIPHER_TYPE_BLOCK_CFB       0x2
#define CIPHER_TYPE_BLOCK_OFB       0x3
#define CIPHER_TYPE_BLOCK_CTR       0x4
#define CIPHER_TYPE_BLOCK_GCTR      0x5
#define CIPHER_TYPE_BLOCK_GMAC      0x6
#define CIPHER_TYPE_BLOCK_GHASH     0x7
#define CIPHER_TYPE_BLOCK_GCM       0x8

#define CIPHER_TYPE_BLOCK_CHACHA    0x1
#define CIPHER_TYPE_BLOCK_CHACHA_POLY1305   0x0

/// Crypto cipher encrypt self-define index
#define TYPE_ENCRYPT 1
/// Crypto cipher decrypt self-define index
#define TYPE_DECRYPT 0
/// Cipher type none for Crypto ROM Code self-define index.
#define CIPHER_TYPE_NONE            0xFF
/// DES_ECB for Crypto ROM Code self-define index.
#define CIPHER_TYPE_DES_ECB         0x0
/// DES_CBC for Crypto ROM Code self-define index.
#define CIPHER_TYPE_DES_CBC         0x1
/// 3DES_ECB for Crypto ROM Code self-define index.
#define CIPHER_TYPE_3DES_ECB        0x10
/// 3DES_CBC for Crypto ROM Code self-define index.
#define CIPHER_TYPE_3DES_CBC        0x11
/// AES_ECB for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_ECB         0x20
/// AES_CBC for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_CBC         0x21
/// AES_CFB for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_CFB         0x22
/// AES_OFB for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_OFB         0x23
/// AES_CTR for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_CTR         0x24  // 0x29
/// AES_GCTR for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_GCTR        0x25
/// AES_GMAC for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_GMAC        0x26
/// AES_GHASH for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_GHASH       0x27
/// AES_GCM for Crypto ROM Code self-define index.
#define CIPHER_TYPE_AES_GCM         0x28

/// Chacha20_Poly1305 for Crypto ROM Code self-define index.
#define CIPHER_TYPE_CHACHA_POLY1305 0x30 // chacha+poly1305
/// Chacha20 for Crypto ROM Code self-define index.
#define CIPHER_TYPE_CHACHA          0x31
/// Poly1305_mode2 for Crypto ROM Code self-define index.
#define CIPHER_TYPE_POLY1305        0x33 // poly1305 - mode 2


