Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_crypto_ctrl.h
#define CRYPTO_ENGINE_SET_MIX_MODE_SSH_ENC_ESP_DEC     0x2
#define CRYPTO_ENGINE_SET_MIX_MODE_SSH_DEC_ESP_ENC     0x3
#define CRYPTO_ENGINE_SET_MIX_MODE_SSL_TLS_ENC         0x4

#define CRYPTO_MIX_MODE_SSH_ENC             0x12
#define CRYPTO_MIX_MODE_SSH_DEC             0x03
#define CRYPTO_MIX_MODE_ESP_ENC             0x13
#define CRYPTO_MIX_MODE_ESP_DEC             0x02
#define CRYPTO_MIX_MODE_SSL_TLS_ENC         0x14
#define CRYPTO_MIX_MODE_MASK_TYPE           0x07    //SSH/ESP/SSL
#define CRYPTO_MIX_MODE_MASK_FUNC           0x10

#define CRYPTO_KEY_STG_INPUT_SK_DIS         0xFF
#define CRYPTO_KEY_STG_ROLE_KEYCFG          0x1
#define CRYPTO_KEY_STG_ROLE_WBCFG           0x2

#define CRYPTO_KEY_STG_LD_SK_EN             0x1
#define CRYPTO_KEY_STG_LD_SK_DIS            0x0
#define KEY_STG_SK_IDX_MASK                 0xF
#define KEY_STG_SK_IDX_NONE                 0xFF
#define KEY_STG_SKTYPE_LD_NOKEY             0x0
#define KEY_STG_SKTYPE_LD_SK                0x1
#define KEY_STG_SKTYPE_LD_KEYBUF            0x2

#define CRYPTO_KEY_STG_WB_SK_EN             0x1
#define CRYPTO_KEY_STG_WB_SK_DIS            0x0

enum {
	CRYPTO_TYPE_CRC32          = 0x50,
	CRYPTO_TYPE_CRC16          = 0x51,
	CRYPTO_TYPE_CRC_CCITT      = 0x52,
	CRYPTO_TYPE_CRC_XMODEM     = 0x53,
	CRYPTO_TYPE_CRC12          = 0x54,
	CRYPTO_TYPE_CRC10          = 0x55,
	CRYPTO_TYPE_CRC8           = 0x56
};

enum {
	KEY_STG_WBTYPE_WB_ONLY_BUF =    0x0,
	KEY_STG_WBTYPE_WB_ONLY_STG =    0x1,
	KEY_STG_WBTYPE_WB_STG_BUF  =    0x2
};

enum {
	KEY_STG_IDX0     = 0x0,
	KEY_STG_IDX1     = 0x1,
	KEY_STG_IDX2     = 0x2,
	KEY_STG_IDX3     = 0x3,
	KEY_STG_IDX4     = 0x4,
	KEY_STG_IDX5     = 0x5,
	KEY_STG_IDX6     = 0x6,
	KEY_STG_IDX7     = 0x7,
	KEY_STG_HUK1     = 0xC,
	KEY_STG_HUK2     = 0xD,
	KEY_STG_SK1      = 0xE,
	KEY_STG_SK2      = 0xF
};

typedef union {
	struct {
		uint8_t idx: 4;         //!<  [3..0] sk_idx
		uint8_t sel: 4;         //!<  [7..4] sk_sel
	} b;
	uint8_t w;
} hal_crypto_key_cfg_t;

typedef union {
	struct {
		uint8_t idx: 4;         //!<  [3..0] wb_idx
		uint8_t sel: 4;         //!<  [7..4] wb_sel
	} b;
	uint8_t w;
} hal_crypto_wb_cfg_t;


/* Data Struct for hp crypto adapter */
/**
 *  \brief Define data struct for hp crypto adapter.
 */
typedef struct hal_crypto_adapter_s {
	CRYPTO_Type *base_addr;     //!< The Crypto register base address
	uint8_t     isInit;         //!< Crypto engine init state: 1=Init, 0=Not init
	uint8_t     isIntMode;      //!< Crypto engine interrupt mode state: 1=Active, 0=Inactive
	uint8_t     isMemDump;      //!< Crypto memory dump control state: 1=Enable, 0=Disable. related \ref __dbg_mem_dump
	uint8_t     initmap;

	//uint8_t dma_burst_num; // 0 ~ 32
	//uint8_t desc_num;  // total number of source/destination description
	//uint8_t mode_select;

	uint32_t    cipher_type;    //!<  Cipher_type ID
	uint8_t     des;            //!<  DES state: 1=Active, 0=Inactive
	uint8_t     trides;         //!<  3DES state: 1=Active, 0=Inactive
	uint8_t     aes;            //!<  AES state: 1=Active, 0=Inactive
	uint8_t     chacha;         //!<  Chacha(including poly1305) state: 1=Active, 0=Inactive
	uint8_t     isDecrypt;      //!<  Decryption state: 1=Enable, 0=Disable
	uint8_t     reserved1[3];   //!<  Reserve

	uint32_t    auth_type;      //!<  Hash_type ID
	uint8_t     isHMAC;         //!<  HMAC state: 1=Active, 0=Inactive
	uint8_t     isMD5;          //!<  MD5 state: 1=Active, 0=Inactive
	uint8_t     isSHA1;         //!<  SHA1 state: 1=Active, 0=Inactive
	uint8_t     isSHA2;         //!<  SHA2 state: 1=Active, 0=Inactive

	/**
	 * Sha2_type ID: 0=None of this mode of sha2, 28=sha2_224 mode(output size is 28bytes),
	 * 32=sha2_256 mode(output size is 32bytes)
	 */
	uint8_t     sha2type;       //!< Sha2_type ID
	uint8_t     reserved2[3];   //!<  Reserve

	uint8_t     mix_mode_type;  //!< Mix mode type: SSH/ESP/SSL
	uint8_t     reserved3[3];   //!<  Reserve

	// hash
	uint32_t    enc_last_data_size;     //!<  Encrypted message of last data size
	uint32_t    aad_last_data_size;     //!<  Additional authenticated data of last data size
	uint32_t    hashpad_last_data_size; //!<  Mix mode Hash padding of last data size
	uint32_t    encpad_last_data_size;  //!<  Mix mode Encryption padding of last data size

	uint32_t    lenAuthKey;     //!<  Key length of authenticated hash
	const uint8_t *pAuthKey;    //!<  Pointer to variable that points the key address of authenticated hash
	uint32_t    digestlen;      //!<  Digest length of hash

	// sequential hash
	uint8_t     hmac_seq_hash_first;    //!<  Sequential hash first one state:  1=Active, 0=Inactive
	uint8_t     hmac_seq_hash_last;     //!<  Sequential hash last one state: 1=Active, 0=Inactive
	uint8_t     hmac_seq_is_recorded;   //!<  Recording a sequential hash: 1=Active, 0=Inactive
	uint8_t     hmac_seq_buf_is_used_bytes;     //!<  Recorded data size in sequential hash buffer
	uint32_t    hmac_seq_hash_total_len;        //!<  Total data length of sequential hash
	uint32_t    hmac_seq_last_msglen;   //!<  Last message length of sequential hash
	uint8_t     *hmac_seq_last_message; //!<  Pointer to variable that points the last message address of sequential hash

	uint32_t    lenCipherKey;   //!<  Key length of Cipher
	const uint8_t *pCipherKey;  //!<  Pointer to variable that points the key address of cipher

	uint32_t    a2eo;           //!<  Additional authenticated data length
	uint32_t    apl_aad;        //!<  Padding length of additional authenticated data
	uint32_t    enl;            //!<  Crypto message length
	uint32_t    apl;            //!<  Padding length of crypto message
	uint32_t    hash_padlen;    //!<  Mix mode hash padding length
	uint32_t    hashpad_pad;    //!<  Mix mode padding length of hash padding
	uint32_t    enc_padlen;     //!<  Mix mode encryption padding length
	uint32_t    encpad_pad;     //!<  Mix mode padding length of encryption padding

	uint8_t     *ipad;          //!<  Pointer to variable that points the inner padding data address of HMAC
	uint8_t     *opad;          //!<  Pointer to variable that points the outer padding data address of HMAC
	// crc
	int32_t     crc_order;      //!<  Cyclic redundancy check order

	//read_crc_setting used
	uint32_t    crc_sel;        //!<  Register value of cyclic redundancy check order
	uint32_t    crc_oswap;      //!<  Register value of cyclic redundancy check refout
	uint32_t    crc_iswap;      //!<  Register value of cyclic redundancy check refin
	uint32_t    crc_oxor;       //!<  Register value of cyclic redundancy check xor
	uint32_t    crc_init;       //!<  Register value of cyclic redundancy check init
	uint32_t    crc_poly;       //!<  Register value of cyclic redundancy check polynomial

	// cache
	uint8_t     is_dst_first_cache_used;    //!<  Destination descriptor that used first cache line: 1=Active, 0=Inactive
	uint8_t     is_dst_last_cache_used;     //!<  Destination descriptor that used last cache line: 1=Active, 0=Inactive
	uint8_t     reserved4[2];   //!<  Reserve

