Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_crypto_ctrl.h
	// Key storage
	uint8_t     is_securekey;
	uint8_t     is_writeback;
	uint8_t     index_securekey;
	uint8_t     index_writeback;
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	uint8_t     user_key[8];
	uint8_t     key_buffer;
	uint8_t     key_lock;
#else
	hal_crypto_key_cfg_t ld_key_cfg;
	hal_crypto_wb_cfg_t wb_key_cfg;
	uint8_t     hmac_seq_hash_sk_last;
	uint8_t     reserved5;
	uint8_t     user_key[8];
	uint8_t     key_buffer;
	uint8_t     user_key_lock;
	uint8_t     reserved6[2];
#endif

	// SHIVL
	uint8_t     is_SHIVL;
	uint8_t     is_wb;
	uint8_t     SHIVL_len;
	//uint8_t     SHIVL_buff[32];

	volatile uint8_t SHIVL_buff[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store inner and outer padding data
	 */
	volatile uint8_t g_IOPAD[CRYPTO_PADSIZE * 2 + 32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store inner and outer padding data
	 */
	volatile uint8_t g_IOPAD_SHA512[CRYPTO_PADSIZE_SHA512 * 2 + 32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store initial vector for AES_GCM/Chacha20/Chacha_poly1305
	 */
	volatile uint8_t  gcm_iv[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store command register data of source descriptor
	 */
	volatile uint8_t  cl_buffer[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store digest result of Hash
	 */
	volatile uint8_t  digest_result[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store digest result of Hash
	 */
	volatile uint8_t  digest_result_SHA512[64] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store temp digest result of Hash
	 */
	volatile uint8_t  temp_digest_result[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store tag result of HMAC
	 */
	volatile uint8_t  tag_result[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store first cache line of source descriptor
	 */
	volatile uint8_t  src_first_cache_line[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store last cache line of source descriptor
	 */
	volatile uint8_t  src_last_cache_line[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store first cache line of destination descriptor
	 */
	volatile uint8_t  dst_first_cache_line[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store last cache line of destination descriptor
	 */
	volatile uint8_t  dst_last_cache_line[32] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store 64 bytes sequential buffer data of Hash
	 */
	volatile uint8_t  hmac_seq_buf[64] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store 64 bytes sequential buffer data of Hash
	 */
	volatile uint8_t  hmac_seq_buf_SHA512[128] __attribute__((aligned(32)));

	/**
	 * 32 bytes aligned buffer that store first cache line of crc_dma modeh
	 */
	volatile uint8_t  crc_first_cache_line[32] __attribute__((aligned(32)));

	/**
	 * 64 bytes aligned buffer that store padding value
	 */
	volatile uint8_t  padding[64] __attribute__((aligned(64)));

	/**
	 * Callback function pointer : Clean D-cache.
	 */
	void (*arch_clean_dcache_by_size)(uint32_t start_address, int32_t size);

	/**
	 * Callback function pointer : Invalidate D-cache.
	 */
	void (*arch_invalidate_dcache_by_size)(uint32_t start_address, int32_t size);

	/**
	 * Callback function pointer : Wait available fifo nodes of source descriptor.
	 */
	int (*fifo_wait_func)(void *pIE1);

	/**
	 * Callback function pointer to \ref g_crypto_pre_exec : Initialize the notified mechanism.
	 */
	int (*pre_exec_func)(void *pIE1);

	/**
	 * Callback function pointer to \ref g_crypto_wait_done : Wait to be notified after
	 * interrupt service routine processed over.
	 */
	int (*wait_done_func)(void *pIE1);

#if IS_CUT_TEST(CONFIG_CHIP_VER)
	uint32_t reserved5[8];   //!<  Reserve
#else
	uint32_t reserved7[8];
#endif
} hal_crypto_adapter_t, *phal_crypto_adapter_t ;

/* Data Struct for crypto Source descriptor */
/**
 *  \brief Define data struct for hp crypto Source descriptor.
 */
typedef union {
	/**
	 *  \brief Source crypto descriptor data format 1.
	 */
	struct {
		uint32_t key_len: 4;        //!<  [3..0] Key length
		uint32_t iv_len: 4;         //!<  [7..4] Initial vector length
		uint32_t keypad_len: 8;     //!<  [15..8] HMAC key padding length
		uint32_t hash_iv_len: 6;    //!<  [21..16] Hash initial value length

		/**
		  *     - 2'b00: disable auto-padding
		  *     - 2'b01: auto-padding for MD5/SHA1/SHA2-224/SHA2-256
		  *     - 2'b1x: auto-padding for SHA2-384/SHA2-512
		  */
		uint32_t ap: 2;             //!<  [23..22] Auto-padding
uint32_t cl:
		2;             //!<  [25..24] Command(setting registers length). When set CL=3, it indicates that this descriptor is pointing to the command setting buffer.
#if 0
		uint32_t rsvd1: 2;          //!<  [27..26] Reserve
#else
		uint32_t sk: 1;             //!<  [26..26] Secure key
		uint32_t wk: 1;             //!<  [27..27] Write back secure key
#endif
		/**
		  * For descriptor which prepares essential parameters, when set, it indicates that this is the last descriptor of an IP packet.
		  */
		uint32_t ls: 1;             //!<  [28..28] Last segment descriptor.

		/**
		  * For descriptor which prepares essential parameters, when set this bit with CL=3,
		  * it indicates that this is the first descriptor of an IP packet. Except setting message buffer address to descriptor,
		  * other setting situations(Key Array, IV Array, PAD Array, SHIVL) need set this field is "1" as well.
		  */
		uint32_t fs: 1;             //!<  [29..29] First segment descriptor.
		uint32_t rs: 1;             //!<  [30..30] Read data from Non-Secure/Secure master port: 1=Secure port, 0=Non-secure port
		uint32_t rsvd2: 1;          //!<  [31..31] Reserve
	} b;

	/**
	 *  \brief Source crypto descriptor data format 2.
	 */
	struct {
		uint32_t apl: 8;            //!<  [7..0] Authentication padding length
		uint32_t a2eo: 5;           //!<  [12..8] Set Additional authentication data length/Encryption padding data length(Mix mode only).

		/**
		  * - This bit is set to zero, it indicates bit field[12..8] is used to set Additional authentication data length.
		  * - This bit is set to one, it indicates bit field[12..8] is used to set Encryption padding data length(Mix mode only).
		  */
		uint32_t zero: 1;           //!<  [13..13] Indicates bit fields[12..8] is used to set A2EO or EPL.
		uint32_t enl: 14;           //!<  [27..14] Encryption length(The message buffer length of Hash/Cipher handling).

		/**
		  * For descriptor which prepares data, when set, it indicates that this is the last descriptor of an IP packet.
		  */
		uint32_t ls: 1;             //!<  [28..28] Last segment descriptor.

		/**
		  * For descriptor which prepares data, when this field is set "0",
		  * it indicates that this descriptor is used to set message buffer.
		  */
		uint32_t fs: 1;             //!<  [29..29] First segment descriptor.
		uint32_t rs: 1;             //!<  [30..30] Read data from Non-Secure/Secure master port: 1=Secure port, 0=Non-secure port
		uint32_t rsvd: 1;           //!<  [31..31] Reserve
	} d;

