Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_crypto_ctrl.h
	int (*hal_crypto_chacha_poly1305_decrypt)(
		hal_crypto_adapter_t *pcrypto_adapter,
		IN const u8 *message, IN const u32 msglen,
		IN const u8 *iv,
		IN const u8 *aad, IN const u32 aadlen,
		OUT u8 *pResult, OUT u8 *pTag);

// CRC
	int (*hal_crypto_crc_setting)(hal_crypto_adapter_t *pcrypto_adapter,
								  IN int order, IN uint32_t polynom,
								  IN uint32_t crcinit, IN uint32_t crcxor, IN uint32_t refin, IN uint32_t refout);

	int (*hal_crypto_crc_cmd)(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

	int (*hal_crypto_crc_dma)(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

	uint32_t (*hal_crypto_crc_get_result)(hal_crypto_adapter_t *pcrypto_adapter);

	int (*hal_crypto_crc32_cmd)(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

	int (*hal_crypto_crc32_dma)(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

// Misc functions for ram code patch
	int (*hal_crypto_engine)(hal_crypto_adapter_t *pcrypto_adapter,
							 IN const u8 *message,     IN const uint32_t msglen,
							 IN const u8 *pIv,         IN const uint32_t ivlen,
							 IN const u8 *paad,     IN const uint32_t aadlen,
							 OUT u8 *pResult, OUT u8 *pTag);

	void (*hal_crypto_engine_get_result)(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest, u8 *pResult, uint32_t len, u8 *pTag);

	void (*hal_crypto_set_srcdesc)(hal_crypto_adapter_t *pcrypto_adapter, uint32_t sd1, uint32_t sdpr);

	void (*hal_crypto_set_dstdesc)(hal_crypto_adapter_t *pcrypto_adapter, uint32_t dd1, uint32_t ddpr);

	void (*hal_crypto_engine_setup_cl_buffer)(hal_crypto_adapter_t *pcrypto_adapter);

// Key Storage

	int (*hal_crypto_key_storage_securekey)(hal_crypto_adapter_t *pcrypto_adapter, uint8_t key_num, bool _UseKey);

#if IS_CUT_TEST(CONFIG_CHIP_VER)
	int (*hal_crypto_key_storage_writekey)(hal_crypto_adapter_t *pcrypto_adapter, uint8_t *key, uint8_t Key_number, bool _Lock, uint8_t keylen);

	int (*hal_crypto_key_storage_writeback)(hal_crypto_adapter_t *pcrypto_adapter, uint8_t Key_number, bool _IsWriteback);

	int (*hal_crypto_key_storage_emptyspace)(hal_crypto_adapter_t *pcrypto_adapter, uint8_t index, uint8_t *result);

	int (*hal_crypto_key_storage_lock)(hal_crypto_adapter_t *pcrypto_adapter, uint8_t Key_number, bool _Lock);
#else
	int (*hal_crypto_key_storage_writekey)(hal_crypto_adapter_t *pcrypto_adapter, uint8_t *key, uint8_t keylen, uint8_t key_num);

	int (*hal_crypto_key_storage_writeback)(hal_crypto_adapter_t *pcrypto_adapter, uint8_t key_num, bool _IsWriteback);

	uint32_t func_resv;

	int (*hal_crypto_key_storage_lock)(hal_crypto_adapter_t *pcrypto_adapter, uint8_t key_num);
#endif

	void (*hal_crypto_cache)(IN phal_crypto_adapter_t pcrypto_adapter, IN void *dcache_clean_function, IN void *dcache_invalidate_function);
#if IS_CUT_TEST(CONFIG_CHIP_VER)
	uint32_t reserved[8];
#else
	int (*hal_crypto_auth_sk_init)(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
								   IN const u8 *pAuthKey, IN const u32 sk_cfg);
	int (*hal_crypto_auth_sk_final)(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest);
	void (*hal_crypto_set_sk_cfg_info)(IN u32 *psk_cfg, IN const u8 cfg, IN const u8 role);
	void (*hal_crypto_get_sk_cfg_info)(IN const u32 sk_cfg, IN u8 *pcfg, IN const u8 role);
	int (*hal_crypto_cipher_sk_init)(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type, IN const u32 sk_cfg, IN const u32 keylen);
	uint32_t reserved[3]; // reserved space for next ROM code version function table extending.
#endif
} hal_crypto_func_stubs_t;

/** @} */ /* End of group hs_hal_crypto */

/*
 * crypto rom code for other functions
 */
void hal_rtl_crypto_engine_set_digestlen(hal_crypto_adapter_t *pcrypto_adapter, IN const uint32_t auth_type);

void hal_rtl_crypto_engine_set_key(hal_crypto_adapter_t *pcrypto_adapter,
								   IN const u8 *pCipherKey, IN const int lenCipherKey,
								   IN const u8 *pAuthKey,   IN const int lenAuthKey);

int hal_rtl_crypto_engine_set_security_mode(hal_crypto_adapter_t *pcrypto_adapter,
		IN const uint32_t cipher_type, IN const uint32_t auth_type,
		IN const void *pCipherKey,     IN const uint32_t lenCipherKey,
		IN const void *pAuthKey,       IN const uint32_t lenAuthKey);

int hal_rtl_crypto_engine_pre_exec(hal_crypto_adapter_t *pcrypto_adapter);

int hal_rtl_crypto_engine_wait_done(hal_crypto_adapter_t *pcrypto_adapter);

void hal_rtl_crypto_start_packet_init(hal_crypto_adapter_t *pcrypto_adapter);

void hal_rtl_crypto_engine_auth_calc_apl(hal_crypto_adapter_t *pcrypto_adapter,
		IN const uint32_t a2eo, IN const uint32_t msglen,
		IN const uint32_t hash_padlen, IN const uint32_t enc_padlen);

uint32_t hal_rtl_crypto_dstdesc_fifo_cnt(hal_crypto_adapter_t *pcrypto_adapter);

void hal_rtl_crypto_set_dstdesc(hal_crypto_adapter_t *pcrypto_adapter, uint32_t dd1, uint32_t ddpr);

uint32_t hal_rtl_crypto_srcdesc_fifo_cnt(hal_crypto_adapter_t *pcrypto_adapter);

void hal_rtl_crypto_set_srcdesc(hal_crypto_adapter_t *pcrypto_adapter, uint32_t sd1, uint32_t sdpr);

void hal_rtl_crypto_engine_setup_cl_buffer(hal_crypto_adapter_t *pcrypto_adapter);

void hal_rtl_crypto_engine_srcdesc_generate_cl_key_iv(hal_crypto_adapter_t *pcrypto_adapter,
		const u8 *p_iv, uint32_t ivLen);

int hal_rtl_crypto_engine(hal_crypto_adapter_t *pcrypto_adapter,
						  IN const u8 *message,    IN const uint32_t msglen,
						  IN const u8 *pIv,        IN const uint32_t ivlen,
						  IN const u8 *paad,     IN const uint32_t aadlen,
						  OUT u8 *pResult, OUT u8 *pTag);

void hal_rtl_crypto_engine_get_result(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest, u8 *pResult,
									  uint32_t len, u8 *pTag);

int hal_rtl_crypto_send_seq_buf(hal_crypto_adapter_t *pcrypto_adapter, u8 *pDigest);

void hal_rtl_crypto_engine_set_encrypt(hal_crypto_adapter_t *pcrypto_adapter);

void hal_rtl_crypto_engine_set_decrypt(hal_crypto_adapter_t *pcrypto_adapter);

int hal_rtl_crypto_cipher_process(hal_crypto_adapter_t *pcrypto_adapter,
								  IN const u8 isEncrypt,  IN const u32 cipher_type,
								  IN const u8 *message,   IN const u32 msglen,
								  IN const u8 *iv,        IN const u32 ivlen,
								  IN const u8 *aad,       IN const u32 aadlen,
								  OUT u8 *pResult,        OUT u8 *pTag);

void hal_rtl_crypto_engine_reset(phal_crypto_adapter_t pcrypto_adapter);

void hal_rtl_crypto_en_ctrl(int en);
void hal_rtl_crypto_cache(phal_crypto_adapter_t pcrypto_adapter, void *dcache_clean_function, void *dcache_invalidate_function);
/*
 * crypto rom code for init/deinit
 */
int hal_rtl_crypto_engine_init(phal_crypto_adapter_t pcrypto_adapter);

int hal_rtl_crypto_engine_deinit(phal_crypto_adapter_t pcrypto_adapter);

