Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/lib/include/rtl8735b_crypto_ctrl.h
/*
 * crypto rom code for authentication algorithms
 *   auth_type =
 * {
 *   AUTH_TYPE_MD5,
 *   AUTH_TYPE_SHA1,
 *   AUTH_TYPE_SHA2_224_ALL,
 *   AUTH_TYPE_SHA2_256_ALL,
 *   AUTH_TYPE_HMAC_MD5,
 *   AUTH_TYPE_HMAC_SHA1,
 *   AUTH_TYPE_HMAC_SHA2_224_ALL,
 *   AUTH_TYPE_HMAC_SHA2_256_ALL
 * }
 */
int hal_rtl_crypto_auth_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
							 const u8 *pAuthKey, const u32 lenAuthKey);

int hal_rtl_crypto_auth_process(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
								IN const u8 *message, IN const u32 msglen, OUT u8 *pDigest);

int hal_rtl_crypto_auth_update(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
							   IN const u8 *message, IN const u32 msglen);

int hal_rtl_crypto_auth_final(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest);

int hal_rtl_crypto_auth(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
						IN const u8 *message, IN const u32 msglen,
						IN const u8 *pAuthKey, IN const u32 lenAuthKey, OUT u8 *pDigest);

int hal_rtl_crypto_auth_init_SHA512(hal_crypto_adapter_t *pcrypto_adapter, const u32 auth_type,
									const u8 *pAuthKey, const u32 lenAuthKey);
int hal_rtl_crypto_auth_update_SHA512(hal_crypto_adapter_t *pcrypto_adapter, const u32 auth_type,
									  const u8 *message, const u32 msglen);
int hal_rtl_crypto_auth_final_SHA512(hal_crypto_adapter_t *pcrypto_adapter, const u32 auth_type, u8 *pDigest);

int hal_rtl_crypto_auth_sk_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type,
								IN const u8 *pAuthKey, IN const u32 sk_cfg);

int hal_rtl_crypto_auth_sk_final(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 auth_type, OUT u8 *pDigest);

/*
 * crypto rom code for cipher algorithms
 *   cipher_type =
 * {
 *   CIPHER_TYPE_AES_ECB,
 *   CIPHER_TYPE_AES_CBC,
 *   CIPHER_TYPE_AES_CFB,
 *   CIPHER_TYPE_AES_OFB,
 *   CIPHER_TYPE_AES_CTR,
 *   CIPHER_TYPE_AES_GCTR,
 *   CIPHER_TYPE_AES_GMAC,
 *   CIPHER_TYPE_AES_GHASH,
 *   CIPHER_TYPE_AES_GCM
 * }
 */
int hal_rtl_crypto_cipher_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
							   IN const u8 *key, IN const u32 keylen);

int hal_rtl_crypto_cipher_encrypt(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
								  IN const u8 *message, IN const u32 msglen,
								  IN const u8 *iv, IN const u32 ivlen,
								  IN const u8 *aad, IN const u32 aadlen,
								  OUT u8 *pResult, OUT u8 *pTag);

int hal_rtl_crypto_cipher_decrypt(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type,
								  IN const u8 *message, IN const u32 msglen,
								  IN const u8 *iv, IN const u32 ivlen,
								  IN const u8 *aad, IN const u32 aadlen,
								  OUT u8 *pResult, OUT u8 *pTag);

int hal_rtl_crypto_cipher_sk_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type, IN const u32 sk_cfg, IN const u32 keylen);

int hal_rtl_crypto_poly1305_init(hal_crypto_adapter_t *pcrypto_adapter, const u8 *key);

int hal_rtl_crypto_poly1305_process(hal_crypto_adapter_t *pcrypto_adapter, const u8 *message, const u32 msglen, u8 *pDigest);
/*
 * crypto rom code for mix mode
 *   mix_mode_type =
 * {
 *   CRYPTO_MIX_MODE_SSH_ENC,
 *   CRYPTO_MIX_MODE_SSH_DEC,
 *   CRYPTO_MIX_MODE_ESP_ENC,
 *   CRYPTO_MIX_MODE_ESP_DEC,
 *   CRYPTO_MIX_MODE_SSL_TLS_ENC
 * }
 */
int hal_rtl_crypto_mix_mode_init(hal_crypto_adapter_t *pcrypto_adapter, IN const u32 cipher_type, IN const u32 auth_type,
								 IN const u8 *cipher_key, IN const u32 cipher_keylen,
								 IN const u8 *auth_key, IN const u32 auth_keylen);

int hal_rtl_crypto_mix_mode_process(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 mix_mode_type,
									IN const u32 cipher_type,
									IN const u8 *message, IN const u32 msglen,
									IN const u8 *iv, IN const u32 ivlen,
									IN const u8 *aad, IN const u32 aadlen,
									IN const u32 auth_type,
									IN const u8 *hash_pad, IN const u32 hash_padlen,
									IN const u8 *enc_pad,  IN const u32 enc_padlen,
									OUT u8 *pResult, OUT u8 *pTag);

void hal_rtl_crypto_key_byte2word(u32 *p, u8 *s_value);

#if IS_CUT_TEST(CONFIG_CHIP_VER)
int hal_rtl_crypto_key_storage_writekey(IN hal_crypto_adapter_t *pcrypto_adapter, uint8_t *key, uint8_t Key_number, bool _Lock, uint32_t keylen);

int hal_rtl_crypto_key_storage_writeback(IN hal_crypto_adapter_t *pcrypto_adapter, IN uint8_t Keynumber, IN bool _IsWriteback);

int hal_rtl_crypto_key_storage_securekey(IN hal_crypto_adapter_t *pcrypto_adapter, IN uint8_t Keynumber, IN bool _UseKey);


int hal_rtl_crypto_key_storage_emptyspace(IN hal_crypto_adapter_t *pcrypto_adapter, IN uint8_t index, OUT uint8_t *result);
#else
int hal_rtl_crypto_key_storage_writekey(hal_crypto_adapter_t *pcrypto_adapter,
										IN uint8_t *key, IN uint8_t keylen,
										IN uint8_t key_num);

int hal_rtl_crypto_key_storage_writeback(IN hal_crypto_adapter_t *pcrypto_adapter, IN uint8_t key_num, IN bool _IsWriteback);

int hal_rtl_crypto_key_storage_securekey(IN hal_crypto_adapter_t *pcrypto_adapter, IN uint8_t key_num, IN bool _UseKey);
#endif

int hal_rtl_crypto_key_stg_wb_sel(hal_crypto_adapter_t *pcrypto_adapter, hal_crypto_wb_cfg_t *pkey_cfg);

int hal_rtl_crypto_key_stg_sk_sel(hal_crypto_adapter_t *pcrypto_adapter, hal_crypto_key_cfg_t *pkey_cfg);

void hal_rtl_crypto_set_sk_cfg_info(IN u32 *psk_cfg, IN const u8 cfg, IN const u8 role);
void hal_rtl_crypto_get_sk_cfg_info(IN const u32 sk_cfg, IN u8 *pcfg, IN const u8 role);
uint32_t hal_rtl_crypto_get_sk_cfg(hal_crypto_adapter_t *pcrypto_adapter, const uint8_t sk_op, const uint8_t sk_idx, const uint8_t wb_op, const uint8_t wb_idx);

//#if defined(CONFIG_BUILD_NONSECURE) && (CONFIG_BUILD_NONSECURE == 1)
#if !defined(CONFIG_BUILD_NONSECURE)


void hal_rtl_crypto_read_crc_setting(hal_crypto_adapter_t *pcrypto_adapter);

int hal_rtl_crypto_crc_wait_done(hal_crypto_adapter_t *pcrypto_adapter);

uint32_t  hal_rtl_crypto_crc_get_result(hal_crypto_adapter_t *pcrypto_adapter);

int hal_rtl_crypto_crc_setting(hal_crypto_adapter_t *pcrypto_adapter,
							   IN int order, IN uint32_t polynom, IN uint32_t crcinit, IN uint32_t crcxor, IN uint32_t refin, IN uint32_t refout);

int hal_rtl_crypto_crc_cmd(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);
int hal_rtl_crypto_crc_dma(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

int hal_rtl_crypto_crc32_cmd(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);
int hal_rtl_crypto_crc32_dma(hal_crypto_adapter_t *pcrypto_adapter, IN const u8 *message, IN const uint32_t msglen);

#endif

#ifdef __cplusplus
}
#endif

#endif /* RTL8710C_CRYPTO_CTRL_H */

